In [1]:
import pandas as pd

In [2]:
import numpy as np

In [6]:
data= np.random.randn(4,3)

In [7]:
dataFrame=pd.DataFrame(data)

In [8]:
dataFrame

          0         1         2
0 -0.432184 -0.851895 -0.721319
1 -1.278256  1.648929  0.060028
2  1.123925  1.436857  0.514531
3 -0.601804  0.732202  0.162387

In [9]:
dataFrame[0]

0   -0.432184
1   -1.278256
2    1.123925
3   -0.601804
Name: 0, dtype: float64

In [11]:
newDF=pd.DataFrame(data,index=["Celal","Hasan","Deniz","Bahadir"],columns=["Maas","Yas","Calisma Saati"])

In [12]:
newDF

             Maas       Yas  Calisma Saati
Celal   -0.432184 -0.851895      -0.721319
Hasan   -1.278256  1.648929       0.060028
Deniz    1.123925  1.436857       0.514531
Bahadir -0.601804  0.732202       0.162387

In [15]:
newDF["Yas"]

Celal     -0.851895
Hasan      1.648929
Deniz      1.436857
Bahadir    0.732202
Name: Yas, dtype: float64

In [22]:
newDF[["Maas","Yas"]]

             Maas       Yas
Celal   -0.432184 -0.851895
Hasan   -1.278256  1.648929
Deniz    1.123925  1.436857
Bahadir -0.601804  0.732202

In [24]:
newDF.loc["Celal"]

Maas            -0.432184
Yas             -0.851895
Calisma Saati   -0.721319
Name: Celal, dtype: float64

In [26]:
newDF.iloc[1]

Maas            -1.278256
Yas              1.648929
Calisma Saati    0.060028
Name: Hasan, dtype: float64

In [27]:
newDF

             Maas       Yas  Calisma Saati
Celal   -0.432184 -0.851895      -0.721319
Hasan   -1.278256  1.648929       0.060028
Deniz    1.123925  1.436857       0.514531
Bahadir -0.601804  0.732202       0.162387

In [28]:
newDF["Ememklilik Yas"]=newDF["Yas"]+newDF["Yas"]

In [29]:
newDF

             Maas       Yas  Calisma Saati  Ememklilik Yas
Celal   -0.432184 -0.851895      -0.721319       -1.703789
Hasan   -1.278256  1.648929       0.060028        3.297857
Deniz    1.123925  1.436857       0.514531        2.873714
Bahadir -0.601804  0.732202       0.162387        1.464405

In [32]:
newDF.drop("Ememklilik Yas",axis=1)#axis=1 ise kolon demek  axis=0 ise satır da ara demek

             Maas       Yas  Calisma Saati
Celal   -0.432184 -0.851895      -0.721319
Hasan   -1.278256  1.648929       0.060028
Deniz    1.123925  1.436857       0.514531
Bahadir -0.601804  0.732202       0.162387

In [33]:
newDF.drop("Bahadir",axis=0)

           Maas       Yas  Calisma Saati  Ememklilik Yas
Celal -0.432184 -0.851895      -0.721319       -1.703789
Hasan -1.278256  1.648929       0.060028        3.297857
Deniz  1.123925  1.436857       0.514531        2.873714

In [34]:
newDF

             Maas       Yas  Calisma Saati  Ememklilik Yas
Celal   -0.432184 -0.851895      -0.721319       -1.703789
Hasan   -1.278256  1.648929       0.060028        3.297857
Deniz    1.123925  1.436857       0.514531        2.873714
Bahadir -0.601804  0.732202       0.162387        1.464405

In [35]:
newDF.drop("Bahadir",axis=0,inplace=True)

In [36]:
newDF

           Maas       Yas  Calisma Saati  Ememklilik Yas
Celal -0.432184 -0.851895      -0.721319       -1.703789
Hasan -1.278256  1.648929       0.060028        3.297857
Deniz  1.123925  1.436857       0.514531        2.873714

In [37]:
newDF.drop("Ememklilik Yas",axis=1,inplace=True)

In [39]:
newDF.loc["Celal"]["Calisma Saati"]

-0.7213193260368936

In [40]:
newDF.loc["Celal","Yas"]

-0.8518946342398004

In [41]:
booleanFrame = newDF < 0

In [42]:
booleanFrame

        Maas    Yas  Calisma Saati
Celal   True   True           True
Hasan   True  False          False
Deniz  False  False          False

In [43]:
newDF[booleanFrame]

           Maas       Yas  Calisma Saati
Celal -0.432184 -0.851895      -0.721319
Hasan -1.278256       NaN            NaN
Deniz       NaN       NaN            NaN

In [45]:
newDF[newDF["Calisma Saati"] > 0]

           Maas       Yas  Calisma Saati
Hasan -1.278256  1.648929       0.060028
Deniz  1.123925  1.436857       0.514531

In [46]:
newDF.reset_index()

   index      Maas       Yas  Calisma Saati
0  Celal -0.432184 -0.851895      -0.721319
1  Hasan -1.278256  1.648929       0.060028
2  Deniz  1.123925  1.436857       0.514531

In [47]:
yeniIndeksListesi = ["Cel","Has","Den"]

In [48]:
newDF["Yeni Indeks"] = yeniIndeksListesi

In [49]:
newDF

           Maas       Yas  Calisma Saati Yeni Indeks
Celal -0.432184 -0.851895      -0.721319         Cel
Hasan -1.278256  1.648929       0.060028         Has
Deniz  1.123925  1.436857       0.514531         Den

In [51]:
newDF.set_index("Yeni Indeks")

                 Maas       Yas  Calisma Saati
Yeni Indeks
Cel         -0.432184 -0.851895      -0.721319
Has         -1.278256  1.648929       0.060028
Den          1.123925  1.436857       0.514531

In [52]:
newDF

           Maas       Yas  Calisma Saati Yeni Indeks
Celal -0.432184 -0.851895      -0.721319         Cel
Hasan -1.278256  1.648929       0.060028         Has
Deniz  1.123925  1.436857       0.514531         Den

In [53]:
newDF.set_index("Yeni Indeks",inplace=True)

In [54]:
newDF

                 Maas       Yas  Calisma Saati
Yeni Indeks
Cel         -0.432184 -0.851895      -0.721319
Has         -1.278256  1.648929       0.060028
Den          1.123925  1.436857       0.514531

In [56]:
newDF.loc["Cel"]

Maas            -0.432184
Yas             -0.851895
Calisma Saati   -0.721319
Name: Cel, dtype: float64

In [57]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park", "South Park", "South Park"]

In [58]:
icIndeksler = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [59]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [60]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [61]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [62]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [63]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [64]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [65]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [66]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [67]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndeks,columns=["Yas","Meslek"])

In [68]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [69]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [70]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       10
Meslek     E
Name: Kenny, dtype: object

In [71]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [72]:
cizgiFilmDataFrame.index.names = ["Film Adı","İsim"]

In [73]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F